Tekla Open API Reference for Tekla Structures 2025
AnalysisPartCompositeProperties.CompositeBeamWidthModeLeft Property
 The composite beam width mode left.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartCompositeProperties.CompositeBeamWidthEnum CompositeBeamWidthModeLeft { get; set; }
Public Property CompositeBeamWidthModeLeft As AnalysisPartCompositeProperties.CompositeBeamWidthEnum
	Get
	Set
Property Value
Type: AnalysisPartCompositeProperties.CompositeBeamWidthEnum
See Also
Reference
AnalysisPartCompositeProperties Class
Tekla.Structures.Analysis Namespace